app/Http/Controllers/Album/AlbumController.php

    private static function getGroupedAlbums($limit) {
        $albums = DB::table('tracks')
                    ->select('album_id', DB::raw('count(*) as total'))
                    ->groupBy('album_id')
                    ->orderBy('total', 'desc')
                    ->take($limit)
                    ->get();
---
select `album_id`, count(*) as total from `tracks` group by `album_id` order by `total` desc limit 20

    public static function getReproductions($a_album)
    {

        $reproductions = DB::table('tracks')
                           ->select('album_id', DB::raw('count(*) as total'))
                           ->where('album_id', $a_album->id)
                           ->groupBy('album_id')
                           ->first();
---
select `album_id`, count(*) as total from `tracks` where `album_id` = '3lQdoVP35ulzlmHEvxcWKF' group by `album_id` limit 1