app/Track.php

    public static function getReproductions($a_track)
    {
        $reproductions = DB::table('tracks')
            ->select('track_id', DB::raw('count(*) as total'))
            ->where('track_id', $a_track->id)
            ->groupBy('track_id')
            ->first();
---
select `track_id`, count(*) as total from `tracks` where `track_id` = '4S6gJt4RYR34t4sjW8wEah' group by `track_id` limit 1

    public static function getProfileReproductions($reproductions)
    {
        $profiles = DB::table('tracks')
            ->select('tracked_by', DB::raw('count(*) as times'))
            ->where('track_id', $reproductions->track_id)
            ->groupBy('tracked_by')
            ->get();
---
select `tracked_by`, count(*) as times from `tracks` where `track_id` = '4S6gJt4RYR34t4sjW8wEah' group by `tracked_by`

    public static function getWhenPlayedAtTracked($track_id, $tracked_by){

        $played_at = DB::table('tracks')
            ->select('played_at')
            ->where('track_id', $track_id)
            ->where('tracked_by', $tracked_by)
            ->orderby('played_at', 'desc')
            ->get();
---
select `played_at` from `tracks` where `track_id` = '4S6gJt4RYR34t4sjW8wEah' and `tracked_by` = '1119239464' order by `played_at` desc