app/Http/Controllers/Ranking/RankingController.php

select distinct * from `spotify_profiles` where `spotify_profiles`.`deleted_at` is null
---
    public function getNumberOfUsers() {
        return SpotifyProfile::distinct()->get()->count();