app/Http/Controllers/Artist/ArtistController.php

select `artist_id`, count(*) as total from `artists` group by `artist_id` order by `total` desc limit 5
---
    private static function getTopReproductionsArtist($limit) {

        $artistByTracks = DB::table('artist_tracks')
            ->leftJoin('profile_tracks', 'profile_tracks.track_id', '=', 'artist_tracks.track_id' )
            ->join('artists', 'artists.artist_id', '=', 'artist_tracks.artist_id')
            ->select('profile_tracks.track_id', 'artists.artist_id');

        $results = DB::table(DB::raw("(" . $artistByTracks->toSql() . ") as artistByTracks"))
            ->mergeBindings($artistByTracks)
            ->select('artist_id', DB::raw('count(*) as total'))
            ->groupBy('artist_id')
            ->orderBy('total', 'desc')
            ->limit($limit)
            ->get();

select `artist_id`, count(*) as total from `artists` where `artist_id` = '5K4W6rqBFWDnAN6FQUkS6x' group by `artist_id` limit 1
---
    public static function getArtistRanking($limit) {

        $artists = self::getTopReproductionsArtist($limit);
        $response = [];

        foreach ((array) $artists as $artist_id => $reproductions){

            $artist = Artist::find($artist_id);

            if (empty($artist->link_to)) {
                $infoArtist = Artist::getSpotifyData($artist_id);

                dd($infoArtist);

                $artist = Artist::updateOrCreate(['artist_id' => $artist_id],
                    [
                        'name' => $infoArtist->name,
                        'image_url_640x640' => $infoArtist->images[0]->url,
                        'image_url_320x320' => $infoArtist->images[1]->url,
                        'image_url_160x160' => $infoArtist->images[2]->url,
                        'link_to' => $infoArtist->href,
                    ]);