app/Http/Controllers/Track/TrackController.php

select * from `tracks` order by `played_at` desc limit 20
---
    public static function getLastTracks($limit) {
        return DB::table('tracks')
                    ->orderby('played_at', 'desc')
                    ->limit($limit)
                    ->get();

select * from `spotify_profiles` where `spotify_profiles`.`deleted_at` is null order by `nick` asc
---
    public function getRecentTracks() {
        $time_start = microtime(true);

        $spotifyWebAPI = new SpotifyWebAPI();

        $spotifyProfiles = SpotifyProfile::orderBy('nick', 'asc')->get();

select * from `tracks` where (`played_at` = '2019-01-30 19:23:11' and `track_id` = '6pVVLXvKIzcOBj7uvoqU9g') limit 1
---
    public function saveRecentTracks($array, $spotifyProfile) {
        $time_start = microtime(true);
        $items = $array->items;
        foreach ($items as $element) {
            $played_at = (new Carbon($element->played_at))->toDateTimeString();
            $response = [
                'played_at' => $played_at,
                'track_id' => $element->track->id,
                'album_id' => $element->track->album->id,
                'name' => $element->track->name,
                'popularity' => $element->track->popularity,
                'tracked_by' => $spotifyProfile->nick,
            ];
            $track = Track::firstOrCreate([
                'played_at' => $played_at,
                'track_id' => $element->track->id,
            ], $response);

select * from `artists` where (`artist_id` = '2kCcBybjl3SAtIcwdWpUe3' and `played_at` = '2019-01-30 19:23:11') limit 1
---
    private function saveArtist($track, $element) {


        $artists = $element->artists;
        foreach ($artists as $a_artist) {

            $response = [
                'artist_id' => $a_artist->id,
                'name' => $a_artist->name,
                'played_at' => $track->played_at,
                'tracked_by' => $track->tracked_by,
                'album_id' => $track->album_id,
                'track_id' => $track->id,
            ];
            $artist = Artist::firstOrCreate(
                [
                    'artist_id' => $a_artist->id,
                    'played_at' => $track->played_at,
                ], $response);

select `name` from `genres` where `artist_id` = '2kCcBybjl3SAtIcwdWpUe3'
select * from `genres` where (`name` = 'underground hip hop' and `played_at` = '2019-01-30 19:23:11') limit 1
---
    private function saveGenre($artist, $track) {

        $clientToken = SpotifySessionController::clientCredentials();
        $spotifyWebAPI = new SpotifyWebAPI();
        $spotifyWebAPI->setAccessToken($clientToken);

        $artist_id = $artist->artist_id;

        $genres = DB::table('genres')
                    ->select('name')
                    ->where('artist_id', $artist_id)
                    ->get()
                    ->pluck('name')
                    ->all();

        if (empty($genres)) {

            $time_getArtist = microtime(true);
            $artistInfo = $spotifyWebAPI->getArtist($artist_id);
            $genres = $artistInfo->genres;
            Log::info('TrackController.saveGenre().emptyGenres.getArtists . ' . (microtime(true) - $time_getArtist));
        }

        foreach ($genres as $a_genre) {

            Genre::firstOrCreate(
                [
                    'name' => strtolower($a_genre),
                    'played_at' => $track->played_at,
                ],
                [
                    'name' => strtolower($a_genre),
                    'played_at' => $track->played_at,
                    'tracked_by' => $track->tracked_by,
                    'artist_id' => $artist_id,
                    'album_id' => $track->album_id,
                ]
            );

select `track_id`, count(*) as total from `tracks` group by `track_id` order by `total` desc limit 5
---
    public static function getTracksRanking($limit) {
        $tracks = DB::table('tracks')
                    ->select('track_id', DB::raw('count(*) as total'))
                    ->groupBy('track_id')
                    ->orderBy('total', 'desc')
                    ->take($limit)
                    ->get();

        return $tracks->pluck('track_id')->all();